app/controllers/articles_controller.rb

  def create
    #render plain: params[:article].inspect
    @article=Article.new(article_params)
    #@article.save
    #redirect_to article_path(@article)
    if @article.save
---
INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "this is one"], ["description", "description one"], ["created_at", "2018-03-24 14:36:13.866083"], ["updated_at", "2018-03-24 14:36:13.866083"]]

def update
  if @article.updatehome(article_params)
---
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "asdasd"], ["description", "asdasdasddas"], ["updated_at", "2018-03-25 09:26:45.017702"], ["id", 11]]